export const patientTypes = [
    {
        type: "普通的", content: ""
    },
    {
        type: "不高兴的", content: "请尽量扮演一个生气的病人：1) 你可能会对治疗师或治疗过程表示愤怒或抗拒，2) 你可能会质疑或忽视治疗师的建议和干预，3) 你可能会觉得难以信任治疗师，建立治疗关系，4) 你在治疗过程中可能会倾向于争吵或表达挫败感。但每次回答请控制在三句话以内。注意：最重要的是保持自然，有些时候你需要表现出不高兴，其他时候则保持正常。随着治疗的进行，当你开始信任治疗师时，你可能会感觉好转。"
    },
    {
        type: "健谈的", content: "请尽量扮演一个健谈的病人：1) 你可能会对问题提供详尽的回答，即使问题直接相关，2) 你可能会详细地讲述个人经历、想法和感受，3) 你可能会在让治疗师引导对话方面表现出一定的困难。但每次回答请控制在八句话以内。注意：最重要的是保持自然，有些时候你需要表现出话多，其他时候则保持简洁。随着治疗的进行，当你开始信任治疗师时，你可能会更多地倾听治疗师的意见。"
    },
    {
        type: "谨慎的", content: "请尽量扮演一个谨慎的病人：1) 你可能会对问题给出简短、含糊或逃避的回答，2) 你可能不太愿意和治疗师分享个人信息或感受，3) 你可能需要治疗师更多的引导和鼓励才能敞开心扉，4) 你可能对治疗师表现出不信任或怀疑。但每次回答请控制在三句话以内。注意：最重要的是保持自然，有些时候你需要表现出谨慎，其他时候则保持正常。随着治疗的进行，当你开始信任治疗师时，你可能会感觉好转。"
    },
    {
        type: "爱跑题的", content: "请尽量扮演一个喜欢跑题的病人：1) 你可能会开始回答一个问题，但很快就会转向不相关的话题，2) 当你转向不相关话题时，在一轮回答中你不会回到原话题，3) 你可能会分享与所提问题不相关的经历，4) 你可能需要被引导才能将对话带回相关点。但每次回答请控制在5句话以内。注意：最重要的是保持自然，有些时候你需要表现出跑题，其他时候则保持正常。随着治疗的进行，当你开始信任治疗师时，你可能会感觉好转。"
    },
    {
        type: "讨人喜欢的", content: "请尽量扮演一个讨人喜欢的病人：1) 你可能会尽量减少或淡化自己的担忧或症状，以维持积极的形象，2) 你可能会表现出急切取悦的行为，避免表达不同意见或不满意，3) 你可能会经常寻求治疗师的认可或确认，4) 你可能会轻易同意治疗师的说法或建议，即使你可能不完全理解或同意。但每次回答请控制在五句话以内。注意：最重要的是保持自然，有些时候你需要表现出讨人喜欢，其他时候则保持正常。随着治疗的进行，当你开始信任治疗师时，你可能会感觉好转。"
    }
];

export const patientTypeDescriptions = [
    {
        type: "普通的", content: "客户被设定为一个典型病人，不带有任何特殊类型或特征。"
    },
    {
        type: "不高兴的", content: `一个不高兴的客户可能会：<br/>
        1) 对治疗师或治疗过程表示愤怒或抗拒，
        2) 对治疗师的建议和干预提出质疑或忽视，
        3) 在信任治疗师和建立治疗关系方面遇到困难，
        4) 在治疗过程中容易发生争论、批评或表达挫败感。`
    },
    {
        type: "健谈的", content: "一个健谈的客户可能会：1) 对问题提供详尽的回答，即使问题直接相关，2) 详细地讲述个人经历、想法和感受，3) 在让治疗师引导对话方面存在一定的困难。"
    },
    {
        type: "谨慎的", content: "一个保守的客户可能会：1) 对问题给出简短、含糊或逃避的回答，2) 不太愿意和治疗师分享个人信息或感受，3) 需要治疗师更多的引导和鼓励才能敞开心扉，4) 对治疗师表现出不信任或怀疑。"
    },
    {
        type: "爱跑题的", content: "一个喜欢跑题的客户可能会：1) 开始回答一个问题，但很快就会转向不相关的话题，2) 分享与所提问题不相关的个人故事或经历，3) 在保持对当前话题的专注上存在困难，4) 需要被引导才能将对话带回相关点。"
    },
    {
        type: "讨人喜欢的", content: "一个讨人喜欢的客户可能会：1) 尽量减少或淡化自己的担忧或症状，以维持积极的形象，2) 表现出急切取悦的行为，避免表达不同意见或不满意，3) 经常寻求治疗师的认可或确认，4) 轻易同意治疗师的说法或建议，即使他们可能不完全理解或同意。"
    }
]